Repository: elebihan/gobjectogen
Catalog: po/*.po
Languages: fr

source: NAME
fr: NOM

source: name of the GObject class (in CamelCase)
fr: nom de la class GObject (en CamelCase)

source: VALUE
fr: VALEUR

source: value of the enumeration
fr: valeur de l'énumération

source: CLASS
fr: CLASSE

source: PROPERTY
fr: PROPRIÉTÉ

source: name of the property
fr: nom de la propriété

source: type of the property
fr: type de la propriété

source: generate code for GBoxed instead of GObject
fr: générer le code pour GBoxed au lieu de GObject

source: set generation mode
fr: définir le mode de génération

source: set namespace
fr: définir l'espace de nommage

source: DIRECTORY
fr: RÉPERTOIRE

source: set output directory
fr: définir le répertoire de sortie

source: set parent class
fr: définir la classe parente

source: set implemented interface
fr: définir une interface implémentée

source: generate an abstract class
fr: générer une classe abstraite

source: generate a boxed type
fr: générer un type 'boxed'

source: generate an interface
fr: générer une interface

source: add an error code
fr: ajouter un code d'erreur

source: include structure to hold private members
fr: inclure une structure pour les variables membres privées

source: include dispose method
fr: inclure une méthode 'dispose'

source: include finalize method
fr: inclure une méthode 'finalize'

source: include method to set properties
fr: inclure une méthode pour affecter les propriétés

source: include method to get properties
fr: inclure une méthode pour lire les propriétés

source: set author of the program
fr: définir l'auteur du programme

source: TEXT
fr: TEXTE

source: set description of the program
fr: définir la description du programme

source: FILE
fr: FICHIER

source: set path to license file
fr: définir le chemin vers le fichier de licence

source: Wrote %s
fr: Écriture de %s
